# -*- coding: utf-8 -*-
"""homework1_8.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1PlgeiZmBxdAV2n85l0ZGFgbwCfHT-Tgi

Напишите рекурсивную функцию, которая находит максимальное число в заданном списке. Программа должна работать для любого количества чисел. Встроенную функцию max() использовать нельзя.
"""

list1 = list(set(map(int, input('Введите список №1: ').split()))) #Добавили set, чтобы удалить дубликаты

def find_max(list1):
    if len(list1) == 1:
        return list1
    elif list1[0] > list1[1]:
        list1.pop(1)
        return find_max(list1)
    elif list1[0] < list1[1]:
        list1.pop(0)
        return find_max(list1)

print(find_max(list1))