# -*- coding: utf-8 -*-
"""Копия блокнота "homework1_6.ipynb"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/138snKQMJKXpJ082rBYmFzNylXltnVa4p

1. Напишите функцию, которая берёт на вход строку и возвращает true, если она является палиндромом и false в противном случае.
"""

def chek_palindrom(string):
    string_clean = ''.join(string.split()) #преобразуем нашу строку в список и обратно, чтобы убрать все пробелы, иначе палиндров типа "а роза упала на лапу азора" выдаст False
    # print(string)
    # print(string_clean)
    return string_clean == string_clean[::-1]

go = chek_palindrom(str(input()))
print(go)

"""2. Напишите и вызовете для себя или какого-нибудь персонажа функцию, которая берёт на вход имя, фамилию, отчество и возраст и возвращает строку вида “Иванов Иван Иванович 1973 г.р. зарегистрирован”.

"""

def DnD_generator(info_list):

    return (f'' + ' '.join(info_list) + ' г.р. зарегистрирован')

vvod_info = []
data = ['Фамилию', 'Имя', 'Отчетсво', 'Возраст']
for i in range(len(data)):
    if data[i] == 'Возраст':
        vvod_info.append(str(int(2023) - int(input(f'Введите ' + data[i] + ':'))))
    else:
        vvod_info.append(input(f'Введите ' + data[i] + ':'))
go = DnD_generator(vvod_info)
print(go)

"""3. Напишите функцию, которая берёт на вход 2 или 3 натуральных числа и возвращает их максимум. Встроенным методом max() пользоваться нельзя Возможно, вам потребуется указать аргумент по умолчанию."""

def maximalochka(chisla_list): #попробовал не указывать просто def function(a,b,c=0): и реализовать возможность ввода любого количества натуральных чисел
    result = int(chisla_list[0])
    for i in range(len(chisla_list)):
        if int(chisla_list[i-1]) <= int(chisla_list[i]):
            if result <= int(chisla_list[i]):
                 result = int(chisla_list[i])
    return result

chisla = []
chislo = int
i = int(0)
while True:
    chislo = input('Введите натуральное число для сравнения. Если числа закончились - оставьте значение пустым: ')
    if chislo == '':
        break
    chisla.append(int(chislo))
result = maximalochka(chisla)
print(result)

# def maximalochka2(chisla_list): #попробовал не указывать просто def function(a,b,c=0): и реализовать возможность ввода любого количества натуральных чисел
#     result = int(chisla_list[0])
#     for i in range(len(chisla_list)):
#         print(i)
#         if int(chisla_list[i-1]) <= int(chisla_list[i]):
#             if result <= int(chisla_list[i]):
#                 result = int(chisla_list[i])
#             print('chisla_list[i-1] ' + str(chisla_list[i-1]))
#             print('chisla_list[i] ' + str(chisla_list[i]))
#             print('result')
#             print(result)
#     print('chisla_list ')
#     print(chisla_list)
#     return result

# chisla = []
# chislo = int
# i = int(0)
# while True:
#     chislo = input('Введите натуральное число для сравнения. Если числа закончились - оставьте значение пустым: ')
#     if chislo == '':
#         break
#     chisla.append(int(chislo))
# 0
# 3
# print(chisla)
# result = maximalochka2(chisla)
# print(result)