# -*- coding: utf-8 -*-
"""HomeWork1-4.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1ayL1NCYXI3BaFBXBkz4ZQNG_kaMp041T

Задача 1.Вводится строка. Нужно превратить строку в список, разбив строку на слова и вывести список из слов, записанный в обратном порядке.
Ввод:Death there mirth way the noisy merit
Вывод:['merit', 'noisy', 'the', 'way', 'mirth', 'there', 'Death']
"""

a = str(input())
split_a = a.split()
split_a.reverse()
print(split_a)

"""Задача 2. Вводится строка из не менее 15 символов, программа выводит на экран символы с чётными номерами (нумерация с 0).
Ввод: In the hole in the ground there lived a hobbit
Вывод: I h oei h rudteelvdahbi

"""

a = str(input())
if len(a) >= 15:
    print(a[::2])
else:
    print('Введите строку с минимум 15 символов!')

"""Задача 3.Вводится список чисел через пробел и натуральное число n - степень. Нужно возвести в заданную степень n все введенные числа.
Желательно сделать, используя списочные выражения
Ввод:3 5 -7 -13 43 8 0 -13 8 -1 2
Вывод: [9, 25, 49, 169, 1849, 64, 0, 169, 64, 1]

"""

a = (input('Введите числа через пробел: '))
split_a = a.split()
n = int(input('Введите степень: '))
result = [int(i) ** n for i in split_a]
print(result)

"""Задача 4. Вводится строка с текстом и символ. Требуется удвоить вхождение введённого символа в текст. Текст состоит из слов, записанных латинскими буквами через пробел, знаков препинания.
Подсказка: вспомните, как работает метод  replace

"""

a = str(input('Введите текст: '))
b = str(input('Введите символ для удвоения: '))
result = a.replace(b, b + b)
print(result)

"""Задача 5. Дана строка. Программа подсчитывает количество символов x и y и выводит строку вида "x: (число), y: (число)."
Подсказка: вспомните метод count, изученный на занятии

"""

a = str(input('Введите строку: '))
x = str(input('Введите искомый x: '))
y = str(input('Введите искомый y: '))

print('x: ' + str(a.count(x)) + ', y: ' + str(a.count(y)))

"""Задача 6.Вводится текст со сбалансированными скобками, программа выводит на экран текст без скобок и их содержимого. На пробелы и знаки препинания внимание не обращать, вложенных скобок в исходной строке нет.
Подсказка: вспомните метод find, изученный на занятии.
Ввод:When he saw Sally (a girl he used to go to school with) in the shop, he could not believe his eyes. She was fantastic (as always)!
Вывод: a girl he used to go to school with
as always

"""

#В условии задания не правильно написан пример. Он выводит содержимое скобок, а не убирает его.

a = str(input('Введите текст со сбалансированными скобками: '))
b, c = a.find('('), a.find(')')
while b != -1 and c != -1:
    a = a[0:b] + a[c+1:]
    b, c = a.find('('), a.find(')')
print(a)