# -*- coding: utf-8 -*-
"""homework1_7.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/14aaOpH_qxrhRPXd5Zsx2Rzfg4i9p9AX1

Задача 1. Напишите программу на Python для поочередного сложения элементов двух заданных списков, используя map и lambda.
"""

#Это если просто складываем два элемента
list1 = input('Введите список №1: ').split()
list2 = input('Введите список №2: ').split()
list3 = list(map(lambda x, y: x + y, list1, list2))
print(list3)

#А это, если хоим именно сложить числа
list1 = input('Введите список №1: ').split()
list2 = input('Введите список №2: ').split()
list3 = list(map(lambda x, y: x + y, list(map(int, list1)), list(map(int, list2))))
print(list3)

#Чуть другой вариант, чтобы сделать лямба функцию поменьше
list1 = list(map(int, input('Введите список №1: ').split()))
list2 = list(map(int, input('Введите список №2: ').split()))
list3 = list(map(lambda x, y: x + y, list1, list2))
print(list3)

"""Задача 2. Напишите программу на Python для поиска чисел из списка, кратных девятнадцати или тринадцати, используя filter и Lambda.

"""

list1 = list(map(int, input('Введите список: ').split()))
list3 = list(filter(lambda x:(x % 19 == 0 or x % 13 == 0) and x != 0, list1))
print(list3)

"""Задача 3. Напишите программу на Python для вычисления наибольшего элемента в списке при помощи reduce

"""

from functools import reduce
list1 = list(map(int, input('Введите список: ').split()))
max = reduce(lambda x,y: x if (x > y) else y, list1)
print(max)