# -*- coding: utf-8 -*-
"""HomeWork1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1rAvoG37mDn_MV2L2jJ3NVC8OrUZjZjKR

#Введение и установка IDE. Ввод и вывод данных в консоль. Объекты. Числа.
"""

#Задание №1. Округление числа до заданного количества знаков после запятой
a = float(input('Введите число для округления: '))
b = int(input('Введите количество знаков после запятой: '))
print(round(a , b))

#Задание №2. Поиск среднего арифметического двух чисел и округление результата до целого
a = float(input('Введите первое число: '))
b = float(input('Введите второе число: '))
print(round((a + b) / 2))

"""# Условный оператор"""

#Задание №1. Пользователь вводит целое число. Проверьте, является ли это число четным. Если число является четным, выведите «Данное число четное», если наоборот – выведите «Данное число не является четным»
a = int(input('Введите целое число: '))
if a % 2 == 0:
    print('Данное число чётное')
else:
    print('Данное число не является чётным')

#Задание №2. Пользователь вводит 2 числа. Вывести на экран большее из этих чисел
a = float(input('Введите первое число: '))
b = float(input('Введите второе число: '))
if a != b:
    if a > b:
        print(a)
    else:
        print(b)

else:
      print('Числа равны, попробуй что-нибудь другое')

#Задание №3.Проверить является ли клетка шахматной доски белой. Пользователь вводит 2 числа (координаты клетки шахматного поля, от 1 до 8). Вывести YES, если клетка белая, и NO, если клетка черная
x = int(input('Введите координату по горизонтали от 1 до 8: '))
y = int(input('Введите координату по вертикали от 1 до 8: '))
if x < 1 or x > 8 or y < 1 or y > 8:
    print('Ваши координаты вне шахматной доски, попробуйте ещё раз')
elif y % 2 == 1:
    if x % 2 == 1:
        print('NO')
    else:
        print('YES YES YES!!!')
elif x % 2 == 1:
    print('YES YES YES!!!')
else:
    print('NO')