# -*- coding: utf-8 -*-
"""homework1_9.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/17rWtayXIjLF96bbhZ3b76ieQepfbVfLu

Задание 1:
Напишите программу, которая будет находить наименьшее общее кратное двух чисел.
Ввод: два числа a и b
Вывод: наименьшее общее кратное чисел a и b
"""

import math

a = int(input('a = :'))
b = int(input('b = :'))
c = a * b
if a == b:
    print(f'Ну тут оба числа одинаковые, соответственно и наименьшее общее кратное у них - они сами, т.е. ' + str(a))
else:
    for i in range(max(a,b), c+1):
        if i % a == 0 and i % b == 0:
            print(i)
            break

"""
Задание 2:
Напишите программу, которая будет находить все простые числа от 1 до n.
Ввод: число n
Вывод: список простых чисел от 1 до n
"""

n = int(input("Введите верхнюю границы для проверки простых чисел: "))
st = set(range(2, n+1))
lst = [1]
while st:
    simple = min(st)
    lst.append(simple)
    st -= set(range(simple, n+1, simple))
print(lst)

"""Задание 3:
Напишите программу, которая будет находить все делители числа n.
Ввод: число n
Вывод: список делителей числа n

"""

n = int(input("У какого числа вы хотите найти делители? "))
lst = []
for i in range(1, n // 2 + 1):
    if n % i == 0:
        lst.append(i)
print(lst)