# -*- coding: utf-8 -*-
"""HomeWork1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1rAvoG37mDn_MV2L2jJ3NVC8OrUZjZjKR
"""

#Задание №1, округление числа до заданного количества знаков после запятой
a = float(input('Введите число для округления: '))
b = int(input('Введите количество знаков после запятой: '))
print(round(a , b))

#Задание №2, поиск среднего арифметического двух чисел и округление результата до целого
a = float(input('Введите первое число: '))
b = float(input('Введите второе число: '))
print(round((a + b) / 2))